---

C#Visual BasicVisual C++

Revit 2024 API
---
LinePatternElement..::..GetLinePattern Method (Document, ElementId)
LinePatternElement Class See Also Send Feedback
---

Gets the LinePattern associated to an element or from a built-in line pattern.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012

# Syntax

C#
---

    public static LinePattern GetLinePattern(
    	Document document,
    	ElementId elementId
    )

Visual Basic
---

    Public Shared Function GetLinePattern ( _
    	document As Document, _
    	elementId As ElementId _
    ) As LinePattern

Visual C++
---

    public:
    static LinePattern^ GetLinePattern(
    	Document^ document,
    	ElementId^ elementId
    )

#### Parameters

document
    Type: Autodesk.Revit.DB..::..Document The document in which to retrieve the LinePattern.

elementId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the LinePatternElement or the built-in line pattern id.

#### Return Value

A copy of LinePattern object. nullNothingnullptra null reference (Nothing in Visual Basic) if the ElementId doesn't represent a line pattern element or built-in line pattern. nullNothingnullptra null reference (Nothing in Visual Basic) for Solid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

LinePatternElement Class

GetLinePattern Overload

Autodesk.Revit.DB Namespace